Revit 2024 API
TableCellStyleOverrideOptions.BorderRightLineStyle Property
 Indicates if the border right line style characteristic is overridden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool BorderRightLineStyle { get; set; }
Visual Basic
Public Property BorderRightLineStyle As Boolean
	Get
	Set
Visual C++
public:
property bool BorderRightLineStyle {
	bool get ();
	void set (bool value);
}
See Also
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace